; domain
(define (domain dominio-drones)
  (:requirements :strips :typing)

  (:types
    dron persona localizacion caja contenido brazo)

  (:predicates
    (dron-en ?d - dron ?l - localizacion)
    (caja-en ?c - caja ?l - localizacion)
    (persona-en ?p - persona ?l - localizacion)
    (sostiene ?d - dron ?b - brazo ?c - caja)
    (brazo-libre ?d - dron ?b - brazo)
    (necesita ?p - persona ?t - contenido)
    (tiene ?p - persona ?t - contenido)
    (contiene ?c - caja ?t - contenido))


  (:action coger
    :parameters (
      ?d - dron 
      ?c - caja 
      ?l - localizacion
      ?b - brazo
    )
    :precondition (
      and (dron-en ?d ?l) 
      ()
      (caja-en ?c ?l) 
      (brazo-libre ?d ?b)
    )
    :effect (
      and (sostiene ?d ?b ?c) 
      (not (caja-en ?c ?l)) 
      (not (brazo-libre ?d ?b))
    )
  )


  (:action volar
    :parameters (
      ?d - dron 
      ?from - localizacion 
      ?to - localizacion
    )
    :precondition (
      dron-en ?d ?from
    )
    :effect (
      and (not (dron-en ?d ?from)) 
      (dron-en ?d ?to)
    )
  )


  (:action entregar
    :parameters (
      ?d - dron 
      ?c - caja 
      ?b - brazo
      ?p - persona 
      ?l - localizacion 
      ?t - contenido
    )
    :precondition (
      and (sostiene ?d ?b ?c) 
      (dron-en ?d ?l) 
      (persona-en ?p ?l)              
      (contiene ?c ?t) 
      (necesita ?p ?t)
    )
    :effect (
      and (tiene ?p ?t) 
      (not (sostiene ?d ?b ?c)) 
      (not (necesita ?p ?t)) 
      (brazo-libre ?d ?b)
    )
  )
)

; problem
(define (problem problema)
  (:domain dominio-drones)
  
  (:objects
    d1 - dron
    b1 b2 - brazo
    p1 p2 p3 p4 - persona
    deposito l1 l2 l3 l4 - localizacion
    c1 c2 c3 c4 c5 c6 c7 - caja
    comida medicina agua - contenido
  )

  (:init
    ;; Ubicación inicial del dron y las cajas en el depósito
    (dron-en d1 deposito)
    (brazo-libre d1 b1)
    (brazo-libre d1 b2)

    (caja-en c1 deposito) (contiene c1 comida)
    (caja-en c2 deposito) (contiene c2 medicina)
    (caja-en c3 deposito) (contiene c3 comida)
    (caja-en c4 deposito) (contiene c4 comida)
    (caja-en c5 deposito) (contiene c5 medicina)
    (caja-en c6 deposito) (contiene c6 medicina)
    (caja-en c7 deposito) (contiene c7 comida)

    ;; Ubicación de las personas y sus necesidades
    (persona-en p1 l1) (necesita p1 comida)
    (persona-en p2 l2) (necesita p2 medicina)
    (persona-en p3 l3) (necesita p3 comida)
    (persona-en p4 l4) (necesita p4 comida))

  (:goal 
    (and
      (tiene p1 comida)
      (tiene p2 medicina)
      (tiene p3 comida)
      (tiene p4 comida)))
)

; plan
1. (coger d1 c2 deposito b2)
   deleted: (caja-en c2 deposito) (brazo-libre d1 b2)
   added: (sostiene d1 b2 c2)
   goals met: 0 of 4
2. (coger d1 c1 deposito b1)
   deleted: (caja-en c1 deposito) (brazo-libre d1 b1)
   added: (sostiene d1 b1 c1)
   goals met: 0 of 4
3. (volar d1 deposito l1)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l1)
   goals met: 0 of 4
4. (entregar d1 c1 b1 p1 l1 comida)
   deleted: (sostiene d1 b1 c1) (necesita p1 comida)
   added: (tiene p1 comida) (brazo-libre d1 b1)
   goals met: 1 of 4
5. (volar d1 l1 deposito)
   deleted: (dron-en d1 l1)
   added: (dron-en d1 deposito)
   goals met: 1 of 4
6. (coger d1 c3 deposito b1)
   deleted: (caja-en c3 deposito) (brazo-libre d1 b1)
   added: (sostiene d1 b1 c3)
   goals met: 1 of 4
7. (volar d1 deposito l3)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l3)
   goals met: 1 of 4
8. (entregar d1 c3 b1 p3 l3 comida)
   deleted: (sostiene d1 b1 c3) (necesita p3 comida)
   added: (tiene p3 comida) (brazo-libre d1 b1)
   goals met: 2 of 4
9. (volar d1 l3 deposito)
   deleted: (dron-en d1 l3)
   added: (dron-en d1 deposito)
   goals met: 2 of 4
10. (coger d1 c4 deposito b1)
   deleted: (caja-en c4 deposito) (brazo-libre d1 b1)
   added: (sostiene d1 b1 c4)
   goals met: 2 of 4
11. (volar d1 deposito l4)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l4)
   goals met: 2 of 4
12. (entregar d1 c4 b1 p4 l4 comida)
   deleted: (sostiene d1 b1 c4) (necesita p4 comida)
   added: (tiene p4 comida) (brazo-libre d1 b1)
   goals met: 3 of 4
13. (volar d1 l4 deposito)
   deleted: (dron-en d1 l4)
   added: (dron-en d1 deposito)
   goals met: 3 of 4
14. (volar d1 deposito l2)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l2)
   goals met: 3 of 4
15. (entregar d1 c2 b2 p2 l2 medicina)
   deleted: (sostiene d1 b2 c2) (necesita p2 medicina)
   added: (tiene p2 medicina) (brazo-libre d1 b2)
   goals met: 4 of 4
